#2 
A = int(input("Введите число А "))
В = int(input("Введите число В "))

if A < B:
    print(i)
else: 
    print("Ошибка А должно быть меньше В")
    
#3
А = int(input("Введите число А"))
В = int(input("Введите число В"))

if A < B: 
        print(i)
else: 
    print("Ошибка А должно быть меньше В")
    
#4
N = int(input("Введите целое число N(>1): "))

K = 1 
while 3*K <= N:
    K +=1 
print("Наименьшее целое число К, при котором выполняется равеннство 3К > N и само значение 3К:", К)
#5
 N = int(input("Введите целое число N(>1): "))
 
K=1 
while 3*K <= N: 
    K += 1 
    
K -= 1
#6
N = int(input("Введите натуральное число N: "))

if N <= 0:
    print("Введите положительное натуральное число")
else:
    i = 1: 
        while i < N:
            print(i)
            i += 1 